docker-code/www/codeigniter4/app/Controllers/Admin/Client.php

SELECT *
FROM `clients`
---
    public function listClients(){
        $ClientModel = new ClientModel();
        $ClientModel ->findAll();

INSERT INTO `clients` (`name`, `email`, `phone`, `address`) VALUES ('pedro  ', 'rosinei.s@hotmail.com', '51982135994', 'Rua')
---
    public function insertClientAction(){
        $data = [
            'name'=> $this -> request -> getVar('name'),
            'email'=> $this -> request -> getVar('email'),
            'phone'=> $this -> request -> getVar('phone'),
            'address'=> $this -> request -> getVar('address')
        ];
        $ClientModel = new ClientModel();
        $ClientModel ->insert($data);