docker-code/www/codeigniter4/app/Controllers/Admin/Contact.php

SELECT *
FROM `contacts`
---
    public function listContacts(){
        $ContactModel = new ContactModel();
        $ContactModel ->findAll();