docker-code/www/codeigniter4/app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `user` = 'adm'
 LIMIT 1
---
    public function getUser($userName){
        return $this ->where('user', $userName)->first();